benchmarks/damBreakWithObstacle/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory
rm log.* 2> /dev/null
rm -r 0.* [1-9]*

# Source tutorial run functions
. /opt/openfoam7/bin/tools/RunFunctions

rm 0/alpha.water 0/U
runApplication blockMesh
runApplication topoSet
runApplication subsetMesh -overwrite c0 -patch walls -noFields
runApplication setFields
runApplication $(getApplication)

#------------------------------------------------------------------------------
